# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2024-06-11 23:20:31 krylon>
#
#+TAGS: optimize(o) refactor(r) bug(b) feature(f) architecture(a)
#+TAGS: web(w) database(d) javascript(j)
#+TODO: TODO(t) IMPLEMENT(i) TEST(e) RESEARCH(r) | DONE(d)
#+TODO: MEDITATE(m) PLANNING(p) REFINE(n) | FAILED(f) CANCELLED(c) SUSPENDED(s)
#+TODO: EXPERIMENT(x) |
#+PRIORITIES: A G D

* Donkey
  A simple-minded network monitoring application
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 20
   #+CAPTION: Clock summary at [2024-06-11 Di 23:20]
   | Headline                 | Time    |       |      |      |
   |--------------------------+---------+-------+------+------|
   | *Total time*             | *18:44* |       |      |      |
   |--------------------------+---------+-------+------+------|
   | Donkey                   | 18:44   |       |      |      |
   | \_  Components [0/0]     |         | 18:44 |      |      |
   | \_    Database [0/0]     |         |       | 4:45 |      |
   | \_    Server [0/0]       |         |       | 9:16 |      |
   | \_      Webservice [0/0] |         |       |      | 3:07 |
   | \_    Agent [0/0]        |         |       | 4:43 |      |
   #+END:
** Diary
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Database [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-06-07 Fr 18:36]--[2024-06-07 Fr 20:42] =>  2:06
    CLOCK: [2024-06-07 Fr 18:20]--[2024-06-07 Fr 18:29] =>  0:09
    CLOCK: [2024-06-07 Fr 17:49]--[2024-06-07 Fr 18:09] =>  0:20
    CLOCK: [2024-06-06 Do 18:39]--[2024-06-06 Do 20:49] =>  2:10
    :END:
*** Server [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-06-10 Mo 22:23]--[2024-06-10 Mo 23:39] =>  1:16
    CLOCK: [2024-06-10 Mo 18:48]--[2024-06-10 Mo 21:31] =>  2:43
    CLOCK: [2024-06-09 So 16:37]--[2024-06-09 So 18:38] =>  2:01
    CLOCK: [2024-06-09 So 16:20]--[2024-06-09 So 16:29] =>  0:09
    :END:
**** Webservice [0/0]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
     :LOGBOOK:
     CLOCK: [2024-06-11 Di 17:36]--[2024-06-11 Di 18:31] =>  0:55
     CLOCK: [2024-06-11 Di 14:15]--[2024-06-11 Di 15:35] =>  1:20
     CLOCK: [2024-06-11 Di 10:55]--[2024-06-11 Di 11:47] =>  0:52
     :END:
     I should probably think about the "language" the Agent and Server speak
     to each other.
*** Agent [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-06-11 Di 19:46]--[2024-06-11 Di 23:19] =>  3:33
    CLOCK: [2024-06-11 Di 18:31]--[2024-06-11 Di 19:41] =>  1:10
    :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
